package com.example.mobiledeveloping

fun main ()
{
    //Задание 1 – Вычисление.
    //8.	Пользователь вводит время в минутах и расстояние в километрах. Найдите скорость в м/c.
    print("Введите время в минутах: ")
    var min = readln().toInt()
    print("Введите расстояние в км: ")
    var km = readln().toInt()

    var speed = (km * 1000) / (min * 60)

    println("Скорость в м/c равна = $speed")


    //Задание 2 – Условные конструкции. Решить двумя способами – с помощью
    // обычного if, с помощью конструкции when
    //5.	Пользователь вводит два числа. Если они не равны 10 и первое число четное, то вывести их сумму, иначе вывести их произведение.



    //Задание 3 – Циклы.
    //23.	Два числа называются дружественными, если каждое из них равно сумме
    // всех делителей второго не считая самого этого числа.
    // Найдите все пары дружественных чисел на отрезке [a;b].



    //Задание 4. Массивы и коллекции
    //10.	В двухмерном массиве переставьте попарно соседние строки,
    // т.е. 1-ю со 2-ой, 3-ю с 4-й и т.д. Результат выведите на экран.

}